product/load-test/results/scenario1-lock/before/run6/compare.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/ann/Programming/Java Projects/hub-eleven/product/load-test/scripts/scenario1-stock-decrease-lock.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m20s max duration (incl. graceful stop):
              * compare: 200 looping VUs for 1m0s (gracefulStop: 20s)

time="2026-08-05T17:42:49+09:00" level=info msg="초기 재고: 99994718" source=console

running (0m01.0s), 200/200 VUs, 119 complete and 0 interrupted iterations
compare   [   2% ] 200 VUs  0m01.0s/1m0s

running (0m02.0s), 200/200 VUs, 234 complete and 0 interrupted iterations
compare   [   3% ] 200 VUs  0m02.0s/1m0s

running (0m03.0s), 200/200 VUs, 416 complete and 0 interrupted iterations
compare   [   5% ] 200 VUs  0m03.0s/1m0s

running (0m04.0s), 200/200 VUs, 596 complete and 0 interrupted iterations
compare   [   7% ] 200 VUs  0m04.0s/1m0s

running (0m05.0s), 200/200 VUs, 779 complete and 0 interrupted iterations
compare   [   8% ] 200 VUs  0m05.0s/1m0s

running (0m06.0s), 200/200 VUs, 969 complete and 0 interrupted iterations
compare   [  10% ] 200 VUs  0m06.0s/1m0s

running (0m07.0s), 200/200 VUs, 1155 complete and 0 interrupted iterations
compare   [  12% ] 200 VUs  0m07.0s/1m0s

running (0m08.0s), 200/200 VUs, 1324 complete and 0 interrupted iterations
compare   [  13% ] 200 VUs  0m08.0s/1m0s

running (0m09.0s), 200/200 VUs, 1492 complete and 0 interrupted iterations
compare   [  15% ] 200 VUs  0m09.0s/1m0s

running (0m10.0s), 200/200 VUs, 1663 complete and 0 interrupted iterations
compare   [  17% ] 200 VUs  0m10.0s/1m0s

running (0m11.0s), 200/200 VUs, 1834 complete and 0 interrupted iterations
compare   [  18% ] 200 VUs  0m11.0s/1m0s

running (0m12.0s), 200/200 VUs, 1937 complete and 0 interrupted iterations
compare   [  20% ] 200 VUs  0m12.0s/1m0s

running (0m13.0s), 200/200 VUs, 2080 complete and 0 interrupted iterations
compare   [  22% ] 200 VUs  0m13.0s/1m0s

running (0m14.0s), 200/200 VUs, 2236 complete and 0 interrupted iterations
compare   [  23% ] 200 VUs  0m14.0s/1m0s

running (0m15.0s), 200/200 VUs, 2298 complete and 0 interrupted iterations
compare   [  25% ] 200 VUs  0m15.0s/1m0s

running (0m16.0s), 200/200 VUs, 2408 complete and 0 interrupted iterations
compare   [  27% ] 200 VUs  0m16.0s/1m0s

running (0m17.0s), 200/200 VUs, 2577 complete and 0 interrupted iterations
compare   [  28% ] 200 VUs  0m17.0s/1m0s

running (0m18.0s), 200/200 VUs, 2676 complete and 0 interrupted iterations
compare   [  30% ] 200 VUs  0m18.0s/1m0s

running (0m19.0s), 200/200 VUs, 2779 complete and 0 interrupted iterations
compare   [  32% ] 200 VUs  0m19.0s/1m0s

running (0m20.0s), 200/200 VUs, 2914 complete and 0 interrupted iterations
compare   [  33% ] 200 VUs  0m20.0s/1m0s

running (0m21.0s), 200/200 VUs, 3040 complete and 0 interrupted iterations
compare   [  35% ] 200 VUs  0m21.0s/1m0s

running (0m22.0s), 200/200 VUs, 3187 complete and 0 interrupted iterations
compare   [  37% ] 200 VUs  0m22.0s/1m0s

running (0m23.0s), 200/200 VUs, 3348 complete and 0 interrupted iterations
compare   [  38% ] 200 VUs  0m23.0s/1m0s

running (0m24.0s), 200/200 VUs, 3515 complete and 0 interrupted iterations
compare   [  40% ] 200 VUs  0m24.0s/1m0s

running (0m25.0s), 200/200 VUs, 3670 complete and 0 interrupted iterations
compare   [  42% ] 200 VUs  0m25.0s/1m0s

running (0m26.0s), 200/200 VUs, 3838 complete and 0 interrupted iterations
compare   [  43% ] 200 VUs  0m26.0s/1m0s

running (0m27.0s), 200/200 VUs, 3971 complete and 0 interrupted iterations
compare   [  45% ] 200 VUs  0m27.0s/1m0s

running (0m28.0s), 200/200 VUs, 4112 complete and 0 interrupted iterations
compare   [  47% ] 200 VUs  0m28.0s/1m0s

running (0m29.0s), 200/200 VUs, 4280 complete and 0 interrupted iterations
compare   [  48% ] 200 VUs  0m29.0s/1m0s

running (0m30.0s), 200/200 VUs, 4447 complete and 0 interrupted iterations
compare   [  50% ] 200 VUs  0m30.0s/1m0s

running (0m31.0s), 200/200 VUs, 4623 complete and 0 interrupted iterations
compare   [  52% ] 200 VUs  0m31.0s/1m0s

running (0m32.0s), 200/200 VUs, 4805 complete and 0 interrupted iterations
compare   [  53% ] 200 VUs  0m32.0s/1m0s

running (0m33.0s), 200/200 VUs, 4995 complete and 0 interrupted iterations
compare   [  55% ] 200 VUs  0m33.0s/1m0s

running (0m34.0s), 200/200 VUs, 5185 complete and 0 interrupted iterations
compare   [  57% ] 200 VUs  0m34.0s/1m0s

running (0m35.0s), 200/200 VUs, 5360 complete and 0 interrupted iterations
compare   [  58% ] 200 VUs  0m35.0s/1m0s

running (0m36.0s), 200/200 VUs, 5547 complete and 0 interrupted iterations
compare   [  60% ] 200 VUs  0m36.0s/1m0s

running (0m37.0s), 200/200 VUs, 5719 complete and 0 interrupted iterations
compare   [  62% ] 200 VUs  0m37.0s/1m0s

running (0m38.0s), 200/200 VUs, 5891 complete and 0 interrupted iterations
compare   [  63% ] 200 VUs  0m38.0s/1m0s

running (0m39.0s), 200/200 VUs, 6046 complete and 0 interrupted iterations
compare   [  65% ] 200 VUs  0m39.0s/1m0s

running (0m40.0s), 200/200 VUs, 6226 complete and 0 interrupted iterations
compare   [  67% ] 200 VUs  0m40.0s/1m0s

running (0m41.0s), 200/200 VUs, 6386 complete and 0 interrupted iterations
compare   [  68% ] 200 VUs  0m41.0s/1m0s

running (0m42.0s), 200/200 VUs, 6565 complete and 0 interrupted iterations
compare   [  70% ] 200 VUs  0m42.0s/1m0s

running (0m43.0s), 200/200 VUs, 6729 complete and 0 interrupted iterations
compare   [  72% ] 200 VUs  0m43.0s/1m0s

running (0m44.0s), 200/200 VUs, 6882 complete and 0 interrupted iterations
compare   [  73% ] 200 VUs  0m44.0s/1m0s

running (0m45.0s), 200/200 VUs, 7046 complete and 0 interrupted iterations
compare   [  75% ] 200 VUs  0m45.0s/1m0s

running (0m46.0s), 200/200 VUs, 7227 complete and 0 interrupted iterations
compare   [  77% ] 200 VUs  0m46.0s/1m0s

running (0m47.0s), 200/200 VUs, 7381 complete and 0 interrupted iterations
compare   [  78% ] 200 VUs  0m47.0s/1m0s

running (0m48.0s), 200/200 VUs, 7562 complete and 0 interrupted iterations
compare   [  80% ] 200 VUs  0m48.0s/1m0s

running (0m49.0s), 200/200 VUs, 7721 complete and 0 interrupted iterations
compare   [  82% ] 200 VUs  0m49.0s/1m0s

running (0m50.0s), 200/200 VUs, 7891 complete and 0 interrupted iterations
compare   [  83% ] 200 VUs  0m50.0s/1m0s

running (0m51.0s), 200/200 VUs, 8056 complete and 0 interrupted iterations
compare   [  85% ] 200 VUs  0m51.0s/1m0s

running (0m52.0s), 200/200 VUs, 8215 complete and 0 interrupted iterations
compare   [  87% ] 200 VUs  0m52.0s/1m0s

running (0m53.0s), 200/200 VUs, 8388 complete and 0 interrupted iterations
compare   [  88% ] 200 VUs  0m53.0s/1m0s

running (0m54.0s), 200/200 VUs, 8569 complete and 0 interrupted iterations
compare   [  90% ] 200 VUs  0m54.0s/1m0s

running (0m55.0s), 200/200 VUs, 8744 complete and 0 interrupted iterations
compare   [  92% ] 200 VUs  0m55.0s/1m0s

running (0m56.0s), 200/200 VUs, 8927 complete and 0 interrupted iterations
compare   [  93% ] 200 VUs  0m56.0s/1m0s

running (0m57.0s), 200/200 VUs, 9103 complete and 0 interrupted iterations
compare   [  95% ] 200 VUs  0m57.0s/1m0s

running (0m58.0s), 200/200 VUs, 9291 complete and 0 interrupted iterations
compare   [  97% ] 200 VUs  0m58.0s/1m0s

running (0m59.0s), 200/200 VUs, 9458 complete and 0 interrupted iterations
compare   [  98% ] 200 VUs  0m59.0s/1m0s

running (1m00.0s), 200/200 VUs, 9633 complete and 0 interrupted iterations
compare   [ 100% ] 200 VUs  1m00.0s/1m0s

running (1m01.0s), 065/200 VUs, 9776 complete and 0 interrupted iterations
compare ↓ [ 100% ] 200 VUs  1m0s
time="2026-08-05T17:43:51+09:00" level=info msg="초기 재고: 99994718" source=console
time="2026-08-05T17:43:51+09:00" level=info msg="최종 재고: 99984877" source=console
time="2026-08-05T17:43:51+09:00" level=info msg="차감된 수량: 9841" source=console
time="2026-08-05T17:43:51+09:00" level=info msg="차감된 수량이 summary의 stock_decrease_successes count와 일치하는지 확인하세요" source=console


  █ THRESHOLDS 

    http_req_duration{scenario:compare}
    ✓ 'max>=0' max=2.79s

    http_req_failed
    ✓ 'rate==0' rate=0.00%

    http_reqs{scenario:compare}
    ✓ 'count>=0' count=9841

    stock_decrease_successes{scenario:compare}
    ✓ 'count>=0' count=9841

    stock_lock_timeout_rate{scenario:compare}
    ✓ 'rate>=0' rate=0.00%

    stock_lock_timeouts{scenario:compare}
    ✓ 'count>=0' count=0

    stock_unexpected_failures
    ✓ 'count==0' count=0

      {scenario:compare}
      ✓ 'count>=0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 9841    160.127323/s
    checks_succeeded...: 100.00% 9841 out of 9841
    checks_failed......: 0.00%   0 out of 9841

    ✓ 차감 성공 또는 락 타임아웃

    CUSTOM
    stock_decrease_successes........: 9841   160.127323/s
      { scenario:compare }..........: 9841   160.127323/s
    stock_lock_timeout_rate.........: 0.00%  0 out of 9841
      { scenario:compare }..........: 0.00%  0 out of 9841
    stock_lock_timeouts.............: 0      0/s
      { scenario:compare }..........: 0      0/s
    stock_unexpected_failure_rate...: 0.00%  0 out of 9841
    stock_unexpected_failures.......: 0      0/s
      { scenario:compare }..........: 0      0/s

    HTTP
    http_req_duration...............: avg=1.23s min=7.63ms  med=1.18s max=2.79s p(90)=1.54s p(95)=1.7s p(99)=2.07s
      { expected_response:true }....: avg=1.23s min=7.63ms  med=1.18s max=2.79s p(90)=1.54s p(95)=1.7s p(99)=2.07s
      { scenario:compare }..........: avg=1.23s min=12.14ms med=1.18s max=2.79s p(90)=1.54s p(95)=1.7s p(99)=2.07s
    http_req_failed.................: 0.00%  0 out of 9843
    http_reqs.......................: 9843   160.159866/s
      { scenario:compare }..........: 9841   160.127323/s

    EXECUTION
    iteration_duration..............: avg=1.23s min=12.33ms med=1.18s max=2.79s p(90)=1.54s p(95)=1.7s p(99)=2.07s
    iterations......................: 9841   160.127323/s
    vus.............................: 65     min=65        max=200
    vus_max.........................: 200    min=200       max=200

    NETWORK
    data_received...................: 5.8 MB 95 kB/s
    data_sent.......................: 1.9 MB 31 kB/s



running (1m01.5s), 000/200 VUs, 9841 complete and 0 interrupted iterations
compare ✓ [ 100% ] 200 VUs  1m0s